# Recommender system

In [1]:
import numpy as np
import pandas as pd

In [2]:
books=pd.read_csv('BX-Books.csv', sep=";", error_bad_lines=False, encoding='latin-1')

b'Skipping line 6452: expected 8 fields, saw 9\nSkipping line 43667: expected 8 fields, saw 10\nSkipping line 51751: expected 8 fields, saw 9\n'
b'Skipping line 92038: expected 8 fields, saw 9\nSkipping line 104319: expected 8 fields, saw 9\nSkipping line 121768: expected 8 fields, saw 9\n'
b'Skipping line 144058: expected 8 fields, saw 9\nSkipping line 150789: expected 8 fields, saw 9\nSkipping line 157128: expected 8 fields, saw 9\nSkipping line 180189: expected 8 fields, saw 9\nSkipping line 185738: expected 8 fields, saw 9\n'
b'Skipping line 209388: expected 8 fields, saw 9\nSkipping line 220626: expected 8 fields, saw 9\nSkipping line 227933: expected 8 fields, saw 11\nSkipping line 228957: expected 8 fields, saw 10\nSkipping line 245933: expected 8 fields, saw 9\nSkipping line 251296: expected 8 fields, saw 9\nSkipping line 259941: expected 8 fields, saw 9\nSkipping line 261529: expected 8 fields, saw 9\n'
C:\Users\dipta\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [4]:
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher',
       'Image-URL-S', 'Image-URL-M', 'Image-URL-L'],
      dtype='object')

In [5]:
books=books[['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication', 'Publisher']]

In [6]:
books.head(2)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [7]:
books.rename(columns={'Book-Title':'title', 'Book-Author':'author', 'Year-Of-Publication':'year', 'Publisher':'publisher'},inplace=True)

In [8]:
books.head(2)

,ISBN,title,author,year,publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada

In [9]:
users=pd.read_csv('BX-Users.csv', sep=";", error_bad_lines=False, encoding='latin-1')

In [10]:
users.head(2)

   User-ID                   Location   Age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [11]:
users.rename(columns={'User-ID':'user_id', 'Location':'location', 'Age':'age'},inplace=True)

In [12]:
users.head(2)

   user_id                   location   age
0        1         nyc, new york, usa   NaN
1        2  stockton, california, usa  18.0

In [13]:
rating=pd.read_csv('BX-Book-Ratings.csv', sep=";", error_bad_lines=False, encoding='latin-1')

In [14]:
rating.head(2)

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5

In [15]:
rating.rename(columns={'User-ID':'user_id','Book-Rating':'rating'},inplace=True)

In [16]:
rating.head(5)

   user_id        ISBN  rating
0   276725  034545104X       0
1   276726  0155061224       5
2   276727  0446520802       0
3   276729  052165615X       3
4   276729  0521795028       6

In [17]:
books.shape

(271360, 5)

In [18]:
users.shape

(278858, 3)

In [19]:
rating.shape

(1149780, 3)

In [20]:
rating['user_id'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
212898     4785
278418     4533
76352      3367
110973     3100
235105     3067
230522     2991
16795      2948
234623     2674
36836      2529
52584      2512
245963     2507
204864     2504
55492      2459
185233     2448
171118     2421
102967     2352
232131     2347
227447     2340
129358     2317
98741      2317
60244      2236
190925     2154
135149     2100
231210     2017
189835     1973
          ...
142306        1
114239        1
112190        1
108092        1
162792        1
124468        1
75308         1
73259         1
69161         1
160745        1
95782         1
91684         1
89635         1
83488         1
273037        1
62998         1
58900         1
15887         1
13838         1
7691          1
3593          1
32263         1
30214         1
24067         1
22018         1
158698        1
17920         1
277135        1
275086        1
187812        1
Name: user_id, Length: 105283, dtype: int64

In [21]:
rating['user_id'].value_counts().shape

(105283,)

In [22]:
x=rating['user_id'].value_counts()>200

In [23]:
x[x]                                                             #gives true values

11676     True
198711    True
153662    True
98391     True
35859     True
212898    True
278418    True
76352     True
110973    True
235105    True
230522    True
16795     True
234623    True
36836     True
52584     True
245963    True
204864    True
55492     True
185233    True
171118    True
102967    True
232131    True
227447    True
129358    True
98741     True
60244     True
190925    True
135149    True
231210    True
189835    True
          ...
141819    True
101305    True
207782    True
258690    True
157811    True
240567    True
95010     True
108005    True
163761    True
187170    True
83287     True
110214    True
56360     True
214272    True
246311    True
151589    True
50547     True
88793     True
33145     True
116122    True
260183    True
155916    True
44296     True
73681     True
59727     True
28634     True
188951    True
9856      True
268622    True
274808    True
Name: user_id, Length: 899, dtype: bool

In [24]:
x[x].shape

(899,)

In [25]:
y=x[x].index                                                         #gives user id

In [26]:
y

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            260183, 155916,  44296,  73681,  59727,  28634, 188951,   9856,
            268622, 274808],
           dtype='int64', length=899)

In [27]:
rating=rating[rating['user_id'].isin(y)]

In [28]:
rating.head()

      user_id        ISBN  rating
1456   277427  002542730X      10
1457   277427  0026217457       0
1458   277427  003008685X       8
1459   277427  0030615321       0
1460   277427  0060002050       0

In [29]:
rating_with_book=rating.merge(books, on='ISBN')

In [30]:
rating_with_book.head(5)

,user_id,ISBN,rating,title,author,year,publisher
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc

In [38]:
number_rating=rating_with_book.groupby('title')['rating'].count().reset_index()

In [39]:
number_rating.head()

                                               title  rating
0   A Light in the Storm: The Civil War Diary of ...       2
1                              Always Have Popsicles       1
2               Apple Magic (The Collector's series)       1
3   Beyond IBM: Leadership Marketing and Finance ...       1
4   Clifford Visita El Hospital (Clifford El Gran...       1

In [40]:
number_rating.rename(columns={'rating':'number of rating'},inplace=True)

In [41]:
number_rating

                                                    title  number of rating
0        A Light in the Storm: The Civil War Diary of ...                 2
1                                   Always Have Popsicles                 1
2                    Apple Magic (The Collector's series)                 1
3        Beyond IBM: Leadership Marketing and Finance ...                 1
4        Clifford Visita El Hospital (Clifford El Gran...                 1
5                                            Dark Justice                 1
6                                                Deceived                 1
7        Earth Prayers From around the World: 365 Pray...                 3
8        Final Fantasy Anthology: Official Strategy Gu...                 3
9        Flight of Fancy: American Heiresses (Zebra Ba...                 1
10       Garfield Bigger and Better (Garfield (Numbere...                 1
11                              God's Little Promise Book                 1
12       Good Wives: Image and Reality in the Lives of...                 5
13       Goosebumps Monster Edition 1: Welcome to Dead...                 3
14       Harry Potter and the Bible: The Menace Behind...                 1
15       Highland Desire (Zebra Splendor Historical Ro...                 1
16       Hiking the California Coastal Trail: Oregon t...                 1
17                                           It Takes Two                 1
18                   LA Gallinita Roja/the Little Red Hen                 2
19       Little Comic Shop of Horrors (Give Yourself G...                 4
20       Murder of a Sleeping Beauty (Scumble River My...                 7
21                                           Mystery Mile                 1
22       Nonbook Materials: The Organization of Integr...                 1
23         Pokemon: The Official Collector's Sticker Book                 1
24       Q-Space (Star Trek The Next Generation, Book 47)                12
25        Q-Zone (Star Trek The Next Generation, Book 48)                 8
26                           Tales of Terror and Suspense                 1
27       The Secret of the Old Clock (Nancy Drew, Book 1)                 2
28       The Tender Commandments : Reflections on the ...                 2
29                          The Town Cats and Other Tales                 1
...                                                   ...               ...
160239                                         seaQuest 2                 2
160240                        sed &amp; awk (2nd Edition)                 1
160241                sed &amp; awk (A Nutshell handbook)                 1
160242                         sharks (reading discovery)                 1
160243                                           stardust                18
160244                                  street bible, the                 1
160245         termcap &amp; terminfo (O'Reilly Nutshell)                 1
160246                               the Dark Light Years                 1
160247                 the Heiress Bride  (sister brides)                 3
160248                                 the Lost and Found                 2
160249                       the Twelve Days of Christmas                 1
160250                              them (Modern Library)                 1
160251                              together by christmas                 7
160252                                       voyage fatal                 1
160253                             wet sand, raven tracks                 1
160254  whataboutrick.com: a poetic tribute to Richard...                 1
160255                   why I'm like this : True Stories                 4
160256                             Â¡Corre, perro, corre!                 1
160257              Â¡Cristina! confidencias de una rubia                 1
160258             Â¿Eres tu mi mamÃ¡?/Are You My Mother?                 1
160259                           Â¿QuÃ© me quieres, amor?                 1
160260  Ã?ber den Wunsch, sich wohlzufÃ¼hlen: Geschichten                 1
160261       Ã?coute ma diffÃ©rence (Le Temps des femmes)                 1
160262                  Ã?ngeles fugaces (Falling Angels)                 1
160263                             Ã?Â?ber das Fernsehen.                 2
160264  Ã?Â?ber die Pflicht zum Ungehorsam gegen den S...                 3
160265                                      Ã?Â?lpiraten.                 1
160266                     Ã?Â?rger mit Produkt X. Roman.                 1
160267                              Ã?Â?stlich der Berge.                 1
160268                                  Ã?Â?thique en toc                 1

[160269 rows x 2 columns]

In [42]:
final_rating=rating_with_book.merge(number_rating, on='title')

In [43]:
final_rating.head()

,user_id,ISBN,rating,title,author,year,publisher,number of rating
0,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
1,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
2,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
3,12538,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82
4,13552,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,82

In [45]:
final_rating=final_rating[final_rating['number of rating']>=50]

In [46]:
final_rating.shape

(61853, 8)

In [47]:
final_rating.drop_duplicates(['user_id','title'],inplace=True)                     #removes same user rating on same book

In [48]:
final_rating.shape

(59850, 8)

In [50]:
book_pivot=final_rating.pivot_table(columns='user_id', index='title', values='rating')

In [53]:
book_pivot.head()

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
1st to Die: A Novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2nd Chance,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN,0.0,NaN
4 Blondes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
84 Charing Cross Road,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,10.0,NaN,NaN,NaN,NaN

In [54]:
book_pivot.shape

(742, 888)

In [57]:
book_pivot.fillna(0, inplace=True)

In [58]:
book_pivot.head()

user_id,254,2276,2766,2977,3363,3757,4017,4385,6242,6251,...,274004,274061,274301,274308,274808,275970,277427,277478,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1st to Die: A Novel,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2nd Chance,0.0,10.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4 Blondes,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
84 Charing Cross Road,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,10.0,0.0,0.0,0.0,0.0

In [59]:
from scipy.sparse import csr_matrix
book_sparse=csr_matrix(book_pivot)                          #removes zero values in matrix

In [62]:
type(book_sparse)

scipy.sparse.csr.csr_matrix

In [63]:
from sklearn.neighbors import NearestNeighbors
model=NearestNeighbors(algorithm='brute')

In [65]:
type(model)

sklearn.neighbors.unsupervised.NearestNeighbors

In [66]:
model.fit(book_sparse)

NearestNeighbors(algorithm='brute', leaf_size=30, metric='minkowski',
         metric_params=None, n_jobs=1, n_neighbors=5, p=2, radius=1.0)

In [81]:
distances, suggestions=model.kneighbors(book_pivot.iloc[237, :].values.reshape(1,-1),n_neighbors=6)                # (1, -1) means 1 row 888 column

In [82]:
distances

array([[ 0.        , 68.78953409, 69.5413546 , 72.64296249, 76.83098333,
        77.28518616]])

In [83]:
suggestions

array([[237, 240, 238, 241, 184, 536]], dtype=int64)

In [85]:
for i in range(len(suggestions)):
    print(book_pivot.index[suggestions[i]])

Index(['Harry Potter and the Chamber of Secrets (Book 2)',
       'Harry Potter and the Prisoner of Azkaban (Book 3)',
       'Harry Potter and the Goblet of Fire (Book 4)',
       'Harry Potter and the Sorcerer's Stone (Book 1)', 'Exclusive',
       'The Cradle Will Fall'],
      dtype='object', name='title')

In [88]:
np.where(book_pivot.index=='Animal Farm')[0][0]                      #extracts true value

54

In [99]:
def recommend_book(book_name):
    book_id=np.where(book_pivot.index==book_name)[0][0]
    distances, suggestions=model.kneighbors(book_pivot.iloc[book_id, :].values.reshape(1,-1),n_neighbors=6)
    
    for i in range(len(suggestions)):
        if i==0:
            print("The suggestions are", book_name,"are :")
        if not i:
            print(book_pivot.index[suggestions[i]])

In [101]:
recommend_book('Harry Potter and the Chamber of Secrets (Book 2)')

The suggestions are Harry Potter and the Chamber of Secrets (Book 2) are :
Index(['Harry Potter and the Chamber of Secrets (Book 2)',
       'Harry Potter and the Prisoner of Azkaban (Book 3)',
       'Harry Potter and the Goblet of Fire (Book 4)',
       'Harry Potter and the Sorcerer's Stone (Book 1)', 'Exclusive',
       'The Cradle Will Fall'],
      dtype='object', name='title')